# ValueAtPoint Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ValueAtPoint Properties
ValueAtPoint Class See Also
---
The ValueAtPoint type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from ValueAtPointBase.) |

# See Also
ValueAtPoint Class
Autodesk.Revit.DB.Analysis Namespace